driver-tests/bpelse/assign/testBooleanOpsBPEL/src/wsdl/tbo.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="tbo"
    targetNamespace="http://j2ee.netbeans.org/wsdl/testBooleanOps/tbo"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:tns="http://j2ee.netbeans.org/wsdl/testBooleanOps/tbo"
    xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
    xmlns:ns0="http://xml.netbeans.org/schema/wsdefs">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/testBooleanOps/tbo"
                    xmlns:tns="http://j2ee.netbeans.org/wsdl/testBooleanOps/tbo"
                    xmlns:ns0="http://xml.netbeans.org/schema/wsdefs">
            <xsd:import schemaLocation="../xsd/wsdefs.xsd" namespace="http://xml.netbeans.org/schema/wsdefs"/>
        </xsd:schema>
    </types>
    <message name="RequestIn">
        <part name="request" element="ns0:request"/>
    </message>
    <message name="ReplyOut">
        <part name="reply" element="ns0:reqply"/>
    </message>
    <portType name="tboPort">
        <operation name="doTBO">
            <input name="input1" message="tns:RequestIn"/>
            <output name="output1" message="tns:ReplyOut"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="tboLink">
        <plnk:role name="tboRole" portType="tns:tboPort"/>
    </plnk:partnerLinkType>
</definitions>
