driver-tests/bpelse/assign/testBooleanOps/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsd="http://xml.netbeans.org/schema/wsdefs">
  <soapenv:Body>
    <wsd:request booleanValue1="false"/>
  </soapenv:Body>
</soapenv:Envelope>