driver-tests/bpelse/assign/testBooleanOps/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:reqply xmlns:msgns="http://j2ee.netbeans.org/wsdl/testBooleanOps/tbo" xmlns:ns1="http://xml.netbeans.org/schema/wsdefs">
      <ns1:test1Result actual="false" expected="true" name="equalsFalse"/>
      <ns1:test2Result actual="false" expected="true" name="notTrue"/>
    </ns1:reqply>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
